{
  "lesson1": {
    "title": "Assembly at Disassembly ng Computer Unit",
    "overview": "Ang lesson na ito ay magtuturo ng step-by-step na proseso ng assembly at disassembly ng computer system. Mahalaga ang kaalaman na ito para sa mga IT technician upang magawa ang computer maintenance at troubleshooting.",
    "parts_of_computer": [
      {
        "name": "CPU (Central Processing Unit)",
        "definition": "Ang CPU ay ang 'utak' ng computer kung saan ginagawa ang lahat ng processing tasks. Dito isinasagawa at ipinaproseso ang mga instructions mula sa mga program ng computer.",
        "image": "assets/image/cpu.jpeg"
      },
      {
        "name": "Motherboard",
        "definition": "Ang motherboard ay ang pangunahing circuit board na nagkokonekta sa lahat ng components ng computer. Dito nakakabit ang CPU, memory, at iba pang parts ng system.",
        "image": "assets/image/motherboard.jpeg"
      },
      {
        "name": "RAM (Random Access Memory)",
        "definition": "Ang RAM ay ang temporary memory ng computer. Dito tinatago ang data na kinakailangan ng CPU para sa mga aktibong tasks at programa. Mas mataas ang RAM, mas mabilis ang performance ng computer.",
        "image": "assets/image/ram.jpeg"
      },
      {
        "name": "Hard Drive (HDD/SSD)",
        "definition": "Ang hard drive ay ang permanent storage device ng computer, kung saan naka-store ang mga files, dokumento, at operating system. Ang SSD ay mas mabilis kumpara sa HDD.",
        "image": "assets/image/hdd.jpeg"
      },
      {
        "name": "Power Supply Unit (PSU)",
        "definition": "Ang PSU ay nagko-convert ng electrical power mula sa wall outlet papunta sa power requirements ng mga internal components ng computer.",
        "image": "assets/image/power_supply.jpeg"
      },
      {
        "name": "Cooling Fans",
        "definition": "Ang cooling fans ay ginagamit upang mapanatiling malamig ang mga internal components ng computer, lalo na ang CPU, para maiwasan ang overheating.",
        "image": "assets/image/cooling fan.jpeg"
      },
      {
        "name": "Optical Drive",
        "definition": "Ang optical drive ay ginagamit upang magbasa at magsulat ng data sa optical discs tulad ng CDs o DVDs, bagaman hindi na ito kadalasang ginagamit sa mga modernong computers.",
        "image": "assets/image/optical drive.jpeg"
      }
    ],
    "step_by_step_procedure": [
      {
        "step": "Step 1",
        "description": "Tamang paggamit ng Anti-Static Wrist Strap: Itakda ang anti-static wrist strap sa iyong pulso at i-clip ang kabilang dulo nito sa metal na bahagi ng computer case upang maiwasan ang static electricity na makakasira sa mga internal components ng computer.",
        "image": "assets/image/step1.jpeg"
      },
      {
        "step": "Step 2",
        "description": "Pagbubukas ng Computer Case: Gumamit ng tamang tools tulad ng screwdrivers upang alisin ang mga screws na nakakabit sa case. Siguraduhing maingat sa paghugot ng mga screws at alisin ang case upang makita ang mga internal parts ng computer.",
        "image": "assets/image/step2.jpeg"
      },
      {
        "step": "Step 3",
        "description": "Pagtanggal ng Mga Bahagi: Alisin ang mga external cables at internal connections tulad ng mga power cables, SATA cables, at memory modules. Gamitin ang tamang pamamaraan upang maiwasang masira ang mga connectors.",
        "image": "assets/image/step3.jpeg"
      },
      {
        "step": "Step 4",
        "description": "Pag-assemble ng mga bahagi: I-assemble ang mga na-disassemble na parts. Siguraduhing nakalagay nang maayos ang bawat bahagi tulad ng CPU, RAM, at Hard Drive, at nakakabit ang lahat ng mga cables.",
        "image": "assets/image/step4jpeg"
      },
      {
        "step": "Step 5",
        "description": "Pag-test ng System: I-connect ang power supply at buksan ang computer. I-check kung ang mga internal components ay tumatakbo ng maayos at walang aberya.",
        "image": "assets/image/step5.jpeg"
      }
    ]
  }
}

